eisup_2019_docmng_integration/src/InformationRegisters/абс_КонтрольАналитикПроектныйУчет/абс_КонтрольАналитикПроектныйУчет.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>абс_КонтрольАналитикПроектныйУчет</name>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <resources>
    <name>КонтрольЗаполнения</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <resources>
    <name>ОтказЗаписи</name>
    <type>
      <types>Boolean</types>
    </type>
  </resources>
  <dimensions>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

eisup_2019_docmng_integration/src/Enums/абс_СтатусыПервичныхДокументов/абс_СтатусыПервичныхДокументов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_СтатусыПервичныхДокументов</name>
  <enumValues>
    <name>Подготовка</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеОФК</name>
  </enumValues>
  <enumValues>
    <name>Отказ</name>
  </enumValues>
  <enumValues>
    <name>ОбработкаБухгалтером</name>
  </enumValues>
  <enumValues>
    <name>ДокументыПринятыБухгалтером</name>
    <comment>Обработка принятых документов (до оптимизации 2018)</comment>
  </enumValues>
  <enumValues>
    <name>Завершен</name>
  </enumValues>
  <enumValues>
    <name>УточнениеОФК</name>
  </enumValues>
  <enumValues>
    <name>УточнениеБухгалтерией</name>
  </enumValues>
  <enumValues>
    <name>КорректировкаДокумента</name>
  </enumValues>
  <enumValues>
    <name>Отмена</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеРП_Источник</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеРП_Приемник</name>
  </enumValues>
  <enumValues>
    <name>Согласован</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДиректоромДирекции</name>
  </enumValues>
  <enumValues>
    <name>ОбработкаДанных</name>
  </enumValues>
  <enumValues>
    <name>ЗагрузкаДанных</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДК</name>
    <comment>Департамент казначейства</comment>
  </enumValues>
  <enumValues>
    <name>СогласованиеОЭФ</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеЭкономистомКЦ</name>
  </enumValues>
  <enumValues>
    <name>БюджетныйКонтроль</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеПДД</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Enums/абсСтатусЗакупочногоЗаказа/абсСтатусЗакупочногоЗаказа.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абсСтатусЗакупочногоЗаказа</name>
  <enumValues>
    <name>Подготовка</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеЦИ</name>
    <comment>Согласование Целевого Использования</comment>
  </enumValues>
  <enumValues>
    <name>УтверждениеДиректоромДирекции</name>
  </enumValues>
  <enumValues>
    <name>УтверждениеРуководителемДепартамента</name>
  </enumValues>
  <enumValues>
    <name>УтверждениеРуководителемЦФО</name>
  </enumValues>
  <enumValues>
    <name>УтверждениеОФК</name>
  </enumValues>
  <enumValues>
    <name>УтверждениеРуководителемДФМ</name>
  </enumValues>
  <enumValues>
    <name>УтверждениеРуководителемЦФУ</name>
  </enumValues>
  <enumValues>
    <name>УтверждениеПВПрдПоЭкономикеИФинансам</name>
  </enumValues>
  <enumValues>
    <name>УтверждениеПрезидентом</name>
  </enumValues>
  <enumValues>
    <name>Отказ</name>
  </enumValues>
  <enumValues>
    <name>Уточнение</name>
  </enumValues>
  <enumValues>
    <name>Согласован</name>
  </enumValues>
  <enumValues>
    <name>ИзменениеСпецификации</name>
  </enumValues>
  <enumValues>
    <name>Исполнение</name>
  </enumValues>
  <enumValues>
    <name>ОбработкаСотрудникомДирККР</name>
  </enumValues>
  <enumValues>
    <name>ОжидаетДоговор</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
  <enumValues>
    <name>Отменен</name>
  </enumValues>
  <enumValues>
    <name>ЗапросИзменений</name>
  </enumValues>
  <enumValues>
    <name>ЗапросУточненияУОФК</name>
  </enumValues>
  <enumValues>
    <name>УточненоДляОФК</name>
  </enumValues>
  <enumValues>
    <name>Завершен</name>
  </enumValues>
  <enumValues>
    <name>Завершение</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДТРвКТТК</name>
  </enumValues>
  <enumValues>
    <name>ОбработкаДирККРвКТТК</name>
  </enumValues>
  <enumValues>
    <name>ИзменениеБюджета</name>
  </enumValues>
  <enumValues>
    <name>ПодтверждениеСпецификации</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеРП</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеЦОФК</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеРуководителемБлока</name>
  </enumValues>
  <enumValues>
    <name>ИзменениеГрафика</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Enums/абсСтатусыСчетов/абсСтатусыСчетов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абсСтатусыСчетов</name>
  <enumValues>
    <name>Отказ</name>
  </enumValues>
  <enumValues>
    <name>Подготовка</name>
  </enumValues>
  <enumValues>
    <name>НалоговыйКонтроль</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДРУ</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДУП</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДРСД</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеОФК</name>
  </enumValues>
  <enumValues>
    <name>УтверждениеРуководителемДФМ</name>
  </enumValues>
  <enumValues>
    <name>УтверждениеВицеПрезидентом</name>
  </enumValues>
  <enumValues>
    <name>УтверждениеПрезидентом</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеЗЗ</name>
  </enumValues>
  <enumValues>
    <name>Согласован</name>
  </enumValues>
  <enumValues>
    <name>ВОплату</name>
  </enumValues>
  <enumValues>
    <name>Исполнение</name>
  </enumValues>
  <enumValues>
    <name>Утвержден</name>
  </enumValues>
  <enumValues>
    <name>ГотовКОплате</name>
  </enumValues>
  <enumValues>
    <name>ОтправленВБанк</name>
  </enumValues>
  <enumValues>
    <name>ПеренесенВГК</name>
  </enumValues>
  <enumValues>
    <name>Оплачен</name>
  </enumValues>
  <enumValues>
    <name>ОплаченЧастично</name>
    <comment>Оплачена часть П/П</comment>
  </enumValues>
  <enumValues>
    <name>Уточнить</name>
  </enumValues>
  <enumValues>
    <name>Уточнено</name>
  </enumValues>
  <enumValues>
    <name>Отменен</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеРП</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДЭФ</name>
  </enumValues>
  <enumValues>
    <name>ДопСогласованиеКТТК</name>
  </enumValues>
  <enumValues>
    <name>ДопСогласованиеОФК</name>
  </enumValues>
  <enumValues>
    <name>ДопУтверждениеРуководителемДФМ</name>
  </enumValues>
  <enumValues>
    <name>ДопУтверждениеВицеПрезидентом</name>
  </enumValues>
  <enumValues>
    <name>ДопУтверждениеПрезидентом</name>
  </enumValues>
  <enumValues>
    <name>ОформлениеАВЗ</name>
  </enumValues>
  <enumValues>
    <name>СчетСогласованАВЗ</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/Enums/абс_СтатусыПроектов/абс_СтатусыПроектов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>абс_СтатусыПроектов</name>
  <enumValues>
    <name>План</name>
  </enumValues>
  <enumValues>
    <name>Действует</name>
  </enumValues>
  <enumValues>
    <name>Закрыт</name>
  </enumValues>
  <enumValues>
    <name>Подготовка</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДТР</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеДЭИ</name>
  </enumValues>
  <enumValues>
    <name>РазработкаТЭО</name>
  </enumValues>
  <enumValues>
    <name>Согласован</name>
  </enumValues>
  <enumValues>
    <name>Отказ</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеИК</name>
  </enumValues>
  <enumValues>
    <name>РазраоткаИТРДП</name>
  </enumValues>
  <enumValues>
    <name>ПроверкаДЭИ</name>
  </enumValues>
  <enumValues>
    <name>Реализация</name>
  </enumValues>
  <enumValues>
    <name>Эксплуатация</name>
  </enumValues>
  <enumValues>
    <name>Архив</name>
  </enumValues>
  <enumValues>
    <name>ОтказСогласования</name>
  </enumValues>
  <enumValues>
    <name>СогласованиеТЭО</name>
  </enumValues>
  <enumValues>
    <name>ТехническоеСогласование</name>
  </enumValues>
  <enumValues>
    <name>РазработкаИИТРТЭО</name>
  </enumValues>
  <enumValues>
    <name>Исполнение</name>
  </enumValues>
</mdclass:Enum>

eisup_2019_docmng_integration/src/InformationRegisters/абс_КонтрольАналитикПроектныйУчет/ManagerModule.bsl
///////////////////////////////////////////////////////////////////////////////
// ПРОГРАММНЫЙ ИНТЕРФЕЙС


Процедура ВыполнитьПроверкуДокументаПроектныйУчет(ДокументОбъект, Организация, Отказ, Ошибки = Ложь) Экспорт 
	
	Если Не глЗначениеПеременной("абс_ПроектныйУчет") Тогда 
		Возврат;
	КонецЕсли;
	
	Если Отказ Тогда 
		Возврат;
	КонецЕсли;
	
	Если ДокументОбъект.ЭтоНовый() Тогда 
		Возврат;
	КонецЕсли;
		
	СтруктураПараметровПроверки = НеобходимаПроверкаДляОрганизации(Организация, ДокументОбъект.Дата);
	
	Если НЕ СтруктураПараметровПроверки.КонтрольЗаполнения Тогда 
		Возврат;
	КонецЕсли;
	
	Если НЕ НеобходимостьПроверкиОтСтатуса(ДокументОбъект) Тогда 
		Возврат;	
	КонецЕсли;
	
	ЗаполненоВШапке 		  = Истина;
	ЗаполненоВТаблицах  	  = Истина;
	ЗаполненоВТаблицеПроектов = Истина;
	ЗаполненоВЗЗ			  = Истина;
	
	МассивСообщений 		  = Новый Массив;
	
	ПроверитьЗаполнениеВШапкеДокумента(ДокументОбъект, ЗаполненоВШапке, МассивСообщений);
	ПроверитьЗаполнениеВТабличныхЧастях(ДокументОбъект, ЗаполненоВТаблицах, МассивСообщений);
	ПроверитьЗаполнениеВТаблицеПроектов(ДокументОбъект, ЗаполненоВТаблицеПроектов, МассивСообщений);
	ПроверитьЗаполнениеВЗЗ(ДокументОбъект, ЗаполненоВЗЗ, МассивСообщений);
	
	ЕстьОшибки = НЕ РезультатЗаполнения(ДокументОбъект, ЗаполненоВШапке,ЗаполненоВТаблицах,ЗаполненоВТаблицеПроектов, ЗаполненоВЗЗ);  
	
	Если ЕстьОшибки Тогда
		ВывестиМассивОшибок(МассивСообщений);
		Отказ = СтруктураПараметровПроверки.ОтказВЗаписи;
	КонецЕсли;
	
КонецПроцедуры

Функция НеобходимаПроверкаДляОрганизации(Организация, Дата) Экспорт
	
	Результат = Новый Структура("КонтрольЗаполнения, ОтказВЗаписи", Ложь, Ложь);
	
	Запрос = Новый Запрос("ВЫБРАТЬ
	|	абс_КонтрольАналитикПроектныйУчетСрезПоследних.ОтказЗаписи КАК ОтказВЗаписи,
	|	абс_КонтрольАналитикПроектныйУчетСрезПоследних.КонтрольЗаполнения
	|ИЗ
	|	РегистрСведений.абс_КонтрольАналитикПроектныйУчет.СрезПоследних(&Период, Организация = &Организация) КАК абс_КонтрольАналитикПроектныйУчетСрезПоследних");
	
	Запрос.УстановитьПараметр("Период", 	 Новый Граница(Дата));
	Запрос.УстановитьПараметр("Организация", Организация);
	
	Выборка = Запрос.Выполнить().Выбрать();
	Если Выборка.Следующий() Тогда 
		ЗаполнитьЗначенияСвойств(Результат, Выборка);
	КонецЕсли;
	
	Возврат Результат;
	
КонецФункции


 ///////////////////////////////////////////////////////////////////////////////
// ПРОЦЕДУРЫ ПРОВЕРКИ ЗАПОЛНЕНИЯ


Процедура ПроверитьЗаполнениеВШапкеДокумента(ДокументОбъект, ЗаполненоВШапке, МассивСообщений)
	
	Если НЕ (ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.РеализацияТоваровУслуг")
		ИЛИ  ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ПолучениеУслугПоПереработке")
		ИЛИ  ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ТребованиеНакладная")
		ИЛИ  ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.АктОбОказанииПроизводственныхУслуг")) Тогда 
		Возврат;	
	КонецЕсли;

	ИмяРеквизита = "Проект";
	Проект = ДокументОбъект[ИмяРеквизита];
	
	Если НЕ ЗначениеЗаполнено(Проект) Тогда
		МассивСообщений.Добавить("Необходимо заполнить проект на закладке ""Дополнительно"".");
		ЗаполненоВШапке = Ложь;
		Возврат;
	КонецЕсли;
	
	Если НЕ ДействующийСтатус(Проект) Тогда
		МассивСообщений.Добавить("На закладке ""Дополнительно"" необходимо указать проект в статусе ""Действует"" или ""Согласован"".");
		ЗаполненоВШапке = Ложь;
	КонецЕсли;
	
	Если НЕ ЗначениеЗаполнено(Проект.абс_РуководительПроекта) Тогда
		МассивСообщений.Добавить("В проекте указанном на закладке ""Дополнительно"" необходимо заполнить реквизит ""Руководитель проекта"".");
		ЗаполненоВШапке = Ложь;
	КонецЕсли;
		
КонецПроцедуры

Процедура ПроверитьЗаполнениеВТабличныхЧастях(ДокументОбъект, ЗаполненоВТаблицах, МассивСообщений)
	
	Если НЕ (ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ТребованиеНакладная")
		ИЛИ ТипЗнч(ДокументОбъект) 	= Тип("ДокументОбъект.ПринятиеКУчетуОС"))Тогда 
		Возврат;	
	КонецЕсли;
		
	СтруктураТабличныхЧастей = ПолучитьТабличныеЧастиИРеквизитыСПроектом(ДокументОбъект);
	
	Для каждого табличнаяЧасть из СтруктураТабличныхЧастей Цикл	
		Для каждого строка из ДокументОбъект[табличнаяЧасть.Ключ] Цикл 
			
			проект = строка[табличнаяЧасть.Значение];
			
			Если НЕ ЗначениеЗаполнено(проект) Тогда
				МассивСообщений.Добавить("Не заполнен реквизит проект в строке № " + Строка(строка.НомерСтроки) + " табличной части """ + табличнаяЧасть.Ключ + """"); 
				ЗаполненоВТаблицах = Ложь;
				Продолжить;
			КонецЕсли;
			
			Если НЕ ДействующийСтатус(проект) Тогда
				МассивСообщений.Добавить("В строке № " + Строка(строка.НомерСтроки) + " табличной части """ + табличнаяЧасть.Ключ + """, необходимо указать проект в статусе ""Действует"" или ""Согласован"". ");
				ЗаполненоВТаблицах = Ложь;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(проект.абс_РуководительПроекта) Тогда
				МассивСообщений.Добавить("В проекте указанном в строке № " + Строка(строка.НомерСтроки) + " табличной части """ + табличнаяЧасть.Ключ + """, необходимо заполнить реквизит ""Руководитель проекта"". ");
				ЗаполненоВТаблицах = Ложь;
			КонецЕсли;
				
		КонецЦикла;	
	КонецЦикла;
		
КонецПроцедуры

Процедура ПроверитьЗаполнениеВТаблицеПроектов(ДокументОбъект, ЗаполненоВТаблицеПроектов, МассивСообщений)
	
	Если НЕ (ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ПлатежноеПоручениеВходящее")
		ИЛИ ТипЗнч(ДокументОбъект)  = Тип("ДокументОбъект.абс_ЗакупочныйЗаказ")
		ИЛИ ТипЗнч(ДокументОбъект) 	= Тип("ДокументОбъект.абс_СчетНаОплату")) Тогда 
		Возврат;	
	КонецЕсли;
	
	Если ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.абс_СчетНаОплату") Тогда		
		Если (ДокументОбъект.Технический) ИЛИ (НЕ ЗначениеЗаполнено(ДокументОбъект.ЗакупочныйЗаказ)) Тогда
			Возврат;
		КонецЕсли;
		Если ДокументОбъект.РаспределениеПоПроектам.Количество() = 0 Тогда 
			МассивСообщений.Добавить("Необходимо заполнить табличную часть ""Доли распределения"" на закладке ""Аналитика"". "); 
			ЗаполненоВТаблицеПроектов = Ложь;
		КонецЕсли;
	КонецЕсли;

	СтруктураТабличныхЧастей = ПолучитьТабличныеЧастиПОПроектам(ДокументОбъект);
	
	Для каждого табличнаяЧасть из СтруктураТабличныхЧастей Цикл	
		Для каждого строка из ДокументОбъект[табличнаяЧасть.Ключ] Цикл 
			
			проект = строка[табличнаяЧасть.Значение];
			ТЧ = ДокументОбъект[табличнаяЧасть.Ключ];
			
			Если НЕ ЗначениеЗаполнено(проект) Тогда
				Если РедактируетсяСписком(ДокументОбъект, ТЧ) Тогда 
					МассивСообщений.Добавить("Не заполнен реквизит проект в строке № " + Строка(строка.НомерСтроки) + " табличной части """ + табличнаяЧасть.Ключ + """"); 
				Иначе
					МассивСообщений.Добавить("Необходимо заполнить проект " + ПолучитьПредставлениеСтраницы(ДокументОбъект) + ".");	
				КонецЕсли;
				ЗаполненоВТаблицеПроектов = Ложь;
				Продолжить;
			КонецЕсли;
			
			Если НЕ ДействующийСтатус(проект) Тогда
				Если РедактируетсяСписком(ДокументОбъект, ТЧ) Тогда 
					МассивСообщений.Добавить("В строке № " + Строка(строка.НомерСтроки) + " табличной части """ + табличнаяЧасть.Ключ + """, необходимо указать проект в статусе ""Действует"" или ""Согласован"". ");
				Иначе
					МассивСообщений.Добавить("Необходимо указать проект в статусе ""Действует"" или ""Согласован"" " + ПолучитьПредставлениеСтраницы(ДокументОбъект) + ". ");	
				КонецЕсли;				
				ЗаполненоВТаблицеПроектов = Ложь;
			КонецЕсли;
			
			Если НЕ ЗначениеЗаполнено(проект.абс_РуководительПроекта) Тогда
				Если РедактируетсяСписком(ДокументОбъект, ТЧ) Тогда 
					МассивСообщений.Добавить("В проекте указанном в строке № " + Строка(строка.НомерСтроки) + " табличной части """ + табличнаяЧасть.Ключ + """, необходимо заполнить реквизит ""Руководитель проектов"". ");
				Иначе
					МассивСообщений.Добавить("В указанном проекте " + ПолучитьПредставлениеСтраницы(ДокументОбъект) + " необходимо заполнить реквизит ""Руководитель проектов"".");
				КонецЕсли;
				ЗаполненоВТаблицеПроектов = Ложь;
			КонецЕсли;

		КонецЦикла;	
	КонецЦикла;
		
КонецПроцедуры

Процедура ПроверитьЗаполнениеВЗЗ(ДокументОбъект, ЗаполненоВЗЗ, МассивСообщений)
	
	Если НЕ (ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.АвансовыйОтчет")
		ИЛИ  ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ПоступлениеТоваровУслуг")) Тогда 
		Возврат;	
	КонецЕсли;

	ИмяРеквизита = "абс_ЗакупочныйЗаказ";
	ЗЗ_Ссылка = ДокументОбъект[ИмяРеквизита];
	ТЧ = ЗЗ_Ссылка.РаспределениеПоПроектам;
	
	Если НЕ ЗначениеЗаполнено(ЗЗ_Ссылка) Тогда
		Возврат;
	КонецЕсли;
	
	Если ЗначениеЗаполнено(ЗЗ_Ссылка.Ресурс) Тогда 
		Возврат;
	КонецЕсли;
	
	Если ТЧ.Количество() < 1 Тогда
		МассивСообщений.Добавить("В документе " + Строка(ДокументОбъект[ИмяРеквизита]) + " необходимо заполнить проект на закладке ""Аналитика"".");
		ЗаполненоВЗЗ = Ложь;
		Возврат;
	КонецЕсли;
	
	Для каждого строка из ТЧ Цикл 
		
		проект = строка.Проект;
		
		Если НЕ ЗначениеЗаполнено(проект) Тогда
			Если РедактируетсяСписком(ЗЗ_Ссылка, ТЧ) Тогда 
				МассивСообщений.Добавить("В документе " + ЗЗ_Ссылка + " не заполнен реквизит проект в строке № " + Строка(строка.НомерСтроки) + " табличной части ""Распределения по проектам""."); 
			Иначе
				МассивСообщений.Добавить("В документе " + ЗЗ_Ссылка + " необходимо заполнить проект " + ПолучитьПредставлениеСтраницы(ЗЗ_Ссылка) + ".");	
			КонецЕсли;
			ЗаполненоВЗЗ = Ложь;
			Продолжить;
		КонецЕсли;
		
		Если НЕ ДействующийСтатус(проект) Тогда
			Если РедактируетсяСписком(ЗЗ_Ссылка, ТЧ) Тогда 
				МассивСообщений.Добавить("В документе " + ЗЗ_Ссылка + " в строке № " + Строка(строка.НомерСтроки) + " табличной части ""Распределения по проектам"", необходимо указать проект в статусе ""Действует"" или ""Согласован"". ");
			Иначе
				МассивСообщений.Добавить("В документе " + ЗЗ_Ссылка + " необходимо указать проект в статусе ""Действует"" " + ПолучитьПредставлениеСтраницы(ЗЗ_Ссылка) + ". ");	
			КонецЕсли;				
			ЗаполненоВЗЗ = Ложь;
		КонецЕсли;
		
		Если НЕ ЗначениеЗаполнено(проект.абс_РуководительПроекта) Тогда
			Если РедактируетсяСписком(ЗЗ_Ссылка, ТЧ) Тогда 
				МассивСообщений.Добавить("В документе " + ЗЗ_Ссылка + " в проекте указанном в строке № " + Строка(строка.НомерСтроки) + " табличной части ""Распределения по проектам"", необходимо заполнить реквизит ""Руководитель проектов"". ");
			Иначе
				МассивСообщений.Добавить("В документе " + ЗЗ_Ссылка + " в указанном проекте " + ПолучитьПредставлениеСтраницы(ЗЗ_Ссылка) + " необходимо заполнить реквизит ""Руководитель проектов"".");
			КонецЕсли;
			ЗаполненоВЗЗ = Ложь;
		КонецЕсли;
		
	КонецЦикла;
		
КонецПроцедуры


///////////////////////////////////////////////////////////////////////////////
// СЛУЖЕБНЫЕ ПРОЦЕДУРЫ И ФУНКЦИИ


Функция ПолучитьТабличныеЧастиИРеквизитыСПроектом(ДокументОбъект)
	
	СтруктураТабличныхЧастей = Новый Структура;
	
	Если ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ТребованиеНакладная") Тогда 
		СтруктураТабличныхЧастей.Вставить("Материалы", "Проект");
	ИначеЕсли ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ПринятиеКУчетуОС") Тогда 
		СтруктураТабличныхЧастей.Вставить("ОсновныеСредства", "Проект");
	КонецЕсли; 
	
	Возврат СтруктураТабличныхЧастей;
	
КонецФункции

Функция ПолучитьТабличныеЧастиПОПроектам(ДокументОбъект)
	
	СтруктураТабличныхЧастей = Новый Структура;
	
	Если ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ПлатежноеПоручениеВходящее") Тогда 
		СтруктураТабличныхЧастей.Вставить("РасшифровкаПлатежа", "Проект");
	ИначеЕсли ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.абс_ЗакупочныйЗаказ") Тогда 
		СтруктураТабличныхЧастей.Вставить("РаспределениеПоПроектам", "Проект");
	ИначеЕсли ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.абс_СчетНаОплату") Тогда 
		СтруктураТабличныхЧастей.Вставить("РаспределениеПоПроектам", "Проект");
	КонецЕсли; 
	
	Возврат СтруктураТабличныхЧастей;
	
КонецФункции

Процедура ВывестиМассивОшибок(МассивСообщений)
	
	Для Каждого строка из МассивСообщений Цикл 
		ОбщегоНазначения.Сообщение(строка);	
	КонецЦикла;
	
КонецПроцедуры

Функция РезультатЗаполнения(ДокументОбъект, ЗаполненоВШапке, ЗаполненоВТаблицах, ЗаполненоВТаблицеПроектов, ЗаполненоВЗЗ)
	
	Если ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ТребованиеНакладная") Тогда 
		Возврат ЗаполненоВШапке ИЛИ ЗаполненоВТаблицах;
	КонецЕсли;
			
	Возврат ЗаполненоВШапке И ЗаполненоВТаблицах И ЗаполненоВТаблицеПроектов И ЗаполненоВЗЗ;
		
КонецФункции

Функция РедактируетсяСписком(ДокументОбъект, ТабличнаяЧасть)
	
	Если ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ПлатежноеПоручениеВходящее") Тогда  
		Возврат ТабличнаяЧасть.Количество() > 1 Или ПараметрыСеанса.абс_ПользовательДЗО;
	ИначеЕсли  ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.абс_СчетНаОплату") Тогда
		Возврат Истина;
	КонецЕсли;
	
	Возврат ТабличнаяЧасть.Количество() > 1
	
КонецФункции

Функция НеобходимостьПроверкиОтСтатуса(ДокументОбъект)
		
	Если (ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.АвансовыйОтчет")
		ИЛИ  ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ПолучениеУслугПоПереработке")
		ИЛИ  ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ТребованиеНакладная")
		ИЛИ  ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.ПоступлениеТоваровУслуг")
		ИЛИ  ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.РеализацияТоваровУслуг")
		ИЛИ  ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.АктОбОказанииПроизводственныхУслуг")) Тогда 
		
		Если ДокументОбъект.Ссылка.абс_Статус <> Перечисления.абс_СтатусыПервичныхДокументов.Подготовка Тогда 
			Возврат Ложь;
		КонецЕсли;
		
		Если ДокументОбъект.абс_Статус = Перечисления.абс_СтатусыПервичныхДокументов.Подготовка Тогда 
			Возврат Ложь;
		КонецЕсли;
		
	ИначеЕсли  ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.абс_ЗакупочныйЗаказ") Тогда
			
		Если ДокументОбъект.Ссылка.Статус = Перечисления.абсСтатусЗакупочногоЗаказа.ИзменениеСпецификации
			И (ДокументОбъект.Статус = Перечисления.абсСтатусЗакупочногоЗаказа.Согласован
			ИЛИ (ДокументОбъект.Статус = Перечисления.абсСтатусЗакупочногоЗаказа.Исполнение)) Тогда 
			Возврат Истина;
		КонецЕсли;
	
		Если ДокументОбъект.Ссылка.Статус <> Перечисления.абсСтатусЗакупочногоЗаказа.Подготовка Тогда 
			Возврат Ложь;
		КонецЕсли;
		
		Если ДокументОбъект.Статус = Перечисления.абсСтатусЗакупочногоЗаказа.Подготовка Тогда 
			Возврат Ложь;
		КонецЕсли;
		
	ИначеЕсли  ТипЗнч(ДокументОбъект) = Тип("ДокументОбъект.абс_СчетНаОплату") Тогда
				
		Если ДокументОбъект.Ссылка.СтатусСчета <> Перечисления.абсСтатусыСчетов.Подготовка Тогда 
			Возврат Ложь;
		КонецЕсли;
		
		Если ДокументОбъект.СтатусСчета = Перечисления.абсСтатусыСчетов.Подготовка Тогда 
			Возврат Ложь;
		КонецЕсли;
		
	КонецЕсли;
	
	Возврат Истина;
	
КонецФункции

Функция ПолучитьПредставлениеСтраницы(Документ)
	
	Если ТипЗнч(Документ) = Тип("ДокументОбъект.ПлатежноеПоручениеВходящее") Тогда 
		Возврат "";		
	ИначеЕсли ТипЗнч(Документ) = Тип("ДокументОбъект.абс_ЗакупочныйЗаказ")
		ИЛИ ТипЗнч(Документ) = Тип("ДокументСсылка.абс_ЗакупочныйЗаказ")
		ИЛИ ТипЗнч(Документ) = Тип("ДокументОбъект.абс_СчетНаОплату")Тогда 
		Возврат "на закладке ""Аналитика""";	
	КонецЕсли;
	
	Возврат "";	
	
КонецФункции

Функция ДействующийСтатус(проект)
	
	Если проект.абс_Статус = Перечисления.абс_СтатусыПроектов.Действует 
		ИЛИ  проект.абс_Статус = Перечисления.абс_СтатусыПроектов.Согласован Тогда 
		Возврат Истина;	
	КонецЕсли;
	
	Возврат Ложь;
	
КонецФункции
